heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf/esb_prx29/main.c
    }
    if(length  > NRF_ESB_MAX_PAYLOAD_LENGTH - START_BYTE)
    {
      //received = 0;

      memcpy(uartbuff+sent_bytes_count,rx_payload.data + START_BYTE,rx_payload.length - START_BYTE);
     // tx_payload.length = rx_payload.length;
      sent_bytes_count += NRF_ESB_MAX_PAYLOAD_LENGTH - START_BYTE;
      length -= NRF_ESB_MAX_PAYLOAD_LENGTH -START_BYTE;
    }
    else
    {
      //memset(tx_payload.data,'/0',strlen(tx_payload.data));
     // memcpy(tx_payload.data+sent_bytes_count,rx_payload.data,rx_payload.length);
      memcpy(uartbuff+sent_bytes_count,rx_payload.data + START_BYTE,rx_payload.length - START_BYTE);
    //  tx_payload.length = rx_payload.length;
      sent_bytes_count += rx_payload.length - START_BYTE;
      if(uartbuff[sent_bytes_count-1] == 0x7E)
      {
           if(header.length == sent_bytes_count)
           {
               sent_bytes_count = 0;
               header.Direction = BACKWORD;// reverse direction;
              

               //send data to uart
           }
      }   
      else
      {
        
         Mater_Data_received = 0;//when haft data come
      }
      
    }
  }
                    
  NRF_LOG_FLUSH();
}
void nrf_esb_event_handler(nrf_esb_evt_t const * p_event)
{
    switch (p_event->evt_id)
    {
        case NRF_ESB_EVENT_TX_SUCCESS:
            NRF_LOG_DEBUG("TX SUCCESS EVENT");
            NRF_LOG_FLUSH();
             Ack_Txing = 1;
             NRF_LOG_FLUSH();
            break;
        case NRF_ESB_EVENT_TX_FAILED:
            NRF_LOG_DEBUG("TX FAILED EVENT");
             NRF_LOG_FLUSH();
             if(tx_payload.data[POS_PACKET_TYPE] == PING_PACKET)
             {
                 neighbour_no++;
             }
             else
             {   // if rx packet is data packet
                  reRouting();
             }
             NRF_LOG_FLUSH();
            break;
        case NRF_ESB_EVENT_RX_RECEIVED:
            {

                if (nrf_esb_read_rx_payload(&rx_payload) == NRF_SUCCESS)
                {
                   circlearr = rx_payload.data;
                   if(circlearr[POS_PACKET_TYPE] == 0)
                   {
                        if(circlearr[(POS_CIRCLE_ARRAY+ Current_Circle ) + 1] != 0)
                        {
                             check_direction(circlearr);
                        }
                       else
                       {
                          Construct_DLMS_Packet();
                       }
                   }
                   pingPacket();
                }  
            }break;
           
#if 0      
            if (nrf_esb_read_rx_payload(&rx_payload) == NRF_SUCCESS)
            {


            #if 0
                //for(uint8_t i = 0;i < MAX_CIRCLE ; i++)
                //{
                
                    if(rx_payload.data[Current_Circle + 1] != 0) //&& rx_payload.data[Current_Circle] == addr_prefix[0])
                    {
                        nrf_esb_stop_rx();
                        memcpy(tx_payload.data+sent_bytes_count,rx_payload.data,rx_payload.length);
                        tx_payload.length = rx_payload.length;
                        tx_payload.noack = false;
                        Send_Data_To_Nxt_Slave = 1;
                        set_slave_adress(rx_payload.data[Current_Circle + 1],arrays[Current_Circle + 1]);
                    }
                //}
 
            }
            #endif
                // Example Debug print]
#if 1
                Circle_No = 0;
                int8_t i,j =0;
                
                memcpy(&header, rx_payload.data, PACKET_HEADER_SIZE); // header copying from rx_payload.data

     
                for( i = 0;i < MAX_CIRCLE; i++)
                {
#if 0 // DD
                    if(rx_payload.data[i] == 0)
                    {
                      if(i != 0)
                      {
                         Circle_No = i - 1;
                      }
                      break;
                    }
#else 
                    if(header.circle_array[i] == 0)
                    {
                      if(i != 0)
                      {
                         Circle_No = i - 1;
                      }
                      break;
                    }
#endif
                    else
                    {
                      Circle_No = MAX_CIRCLE;
                    }
                }

                if(Circle_No > Current_Circle)
                {
                     nrf_esb_stop_rx();
                     memcpy(tx_payload.data,rx_payload.data,rx_payload.length);
                     tx_payload.length = rx_payload.length;
                     tx_payload.noack = false;
                     Send_Data_To_Nxt_Slave = 1;
                     #if 0
                     set_slave_adress(rx_payload.data[Current_Circle + 1],arrays[Current_Circle + 1]);
                     #else
                     set_slave_adress(header.circle_array[Current_Circle + 1],arrays[Current_Circle + 1]);
                     #endif
                }
                #if 0
                else if((Circle_No == Current_Circle) && (rx_payload.data[Circle_No] != 0))
                #else
                else if((Circle_No == Current_Circle) && (header.circle_array[Circle_No] != 0))
                {
                   Construct_DLMS_Packet();
                } 
                #endif
                else
                {
                    for(j = Circle_No ; j < MAX_CIRCLE ; j++)
                    {
                    #if 0
                        if(rx_payload.data[j] != 0)
                        {
                            nrf_esb_stop_rx();
                            if(j+1 >= 4)
                            {
                                //send data to dcu       
                            }
                            else
                            {
                               set_slave_adress(rx_payload.data[j+1],arrays[MAX_CIRCLE - j]);
                            }
                            rx_payload.data[j] = 0;
                            memcpy(tx_payload.data+sent_bytes_count,rx_payload.data,rx_payload.length);
                            tx_payload.length = rx_payload.length;
                            tx_payload.noack = false;
                            Send_Data_To_Nxt_Slave = 1;
                        }
                        #else // DD
                        if(header.circle_array[j] != 0)
                        {
                            nrf_esb_stop_rx();
                            if(j+1 >= 4)
                            {
                                //send data to dcu  
                                NRF_LOG_INFO("Sending to DCU");
                                NRF_LOG_FLUSH(); 
                            }
                            else
                            {
                            #if 0
                               set_slave_adress(rx_payload.data[j+1],arrays[MAX_CIRCLE - j]);
                               #else
                               set_slave_adress(header.circle_array[j+1],arrays[MAX_CIRCLE - j]);
                               #endif
                            }
                            #if 0
                            rx_payload.data[j] = 0;
                            #else
                            header.circle_array[j] = 0;
                            #endif
                            memcpy(tx_payload.data+sent_bytes_count,rx_payload.data,rx_payload.length);
                            tx_payload.length = rx_payload.length;
                            tx_payload.noack = false;
                            Send_Data_To_Nxt_Slave = 1;
                        }
                        #endif
                    }
                } 
            }
            #endif
#endif
    
        //}break;
    }
}

void reRouting(void)
{
      tx_payload.data[POS_DIRTY_FLAG] = 1;
   
       if(tx_payload.data[POS_DIRECTION] == FORWARD)
       {
          if(Nxt_neighbor < &Nxt_neighbor_table[MAX_NEIGHBORS]) 
          {
             Nxt_neighbor++;
             if(Nxt_neighbor->node_id == 0)
             {
                Nxt_neighbor = &Nxt_neighbor_table[0];
             }
          }
          else
          {
             Nxt_neighbor = &Nxt_neighbor_table[0];
          }
          tx_payload.data[POS_CIRCLE_ARRAY+ Current_Circle + 1] = Nxt_neighbor->node_id;
 
          set_slave_adress(Nxt_neighbor->node_id, arrays[Current_Circle + 1]);
          sendDataToNextSlave();         
    
