heyjarvisai7/RF_MASTER_CODE/fun_mcode/nRF5_SDK_17.1.0_ddde560/examples/proprietary_rf/esb_prx29/main.c
        sort_neighbors_by_rssi(Nxt_neighbor_table, Nxt_table_index - 1);
    }

    Diagnostic_Test = 0;

    Nxt_neighbor  = &Nxt_neighbor_table[0];
    Prev_neighbor = &Prev_neighbor_table[0];
}

static void diagnostic_tx(uint8_t neighbour, uint8_t circle)
{
    nrf_esb_stop_rx();

    set_slave_adress(neighbour, arrays[circle]);

    memset(&header, 0, sizeof(header));
    header.packet_type = 1;
    header.length = 1;
    header.circle_array[Current_Circle] = addr_prefix[0];

    memcpy(tx_payload.data, &header, sizeof(header));
    memcpy(tx_payload.data + sizeof(header), "Hello", sizeof("Hello"));
    tx_payload.length = sizeof(header) + sizeof("Hello");

    if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
    {
        nrf_delay_us(50000);
    }
}

#if 0
void doDiagnosticTest(void)
{       
          Nxt_table_index = 0;
          Prev_table_index = 0;
          uint8_t done_rx_start = 1;
          if(Current_Circle == MIN_CIRCLE)
          {

                for(neighbour_no = MIN_NODES; neighbour_no < MAX_NODES ;)
                {

                    if(Ack_Txing == 0)
                    {
                          nrf_esb_stop_rx();
                          set_slave_adress( neighbour_no ,arrays[Current_Circle + 1]);
                          memset(&header,0,sizeof(header));
                          header.packet_type = 1;
                          header.length = 1;
                          header.circle_array[Current_Circle] = addr_prefix[0];
                          memcpy(tx_payload.data,&header,sizeof(header));
                          memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                          tx_payload.length = (sizeof(header) + sizeof("HAI"));
                          done_rx_start = 1;
                          if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                          {
                                nrf_delay_us(50000); //to send the data 
                                //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);

                          }
                    }
                    if(done_rx_start == 1 && Ack_Txing == 1)
                    {
                          done_rx_start = 0;
                             nrf_esb_flush_tx();
                            nrf_esb_flush_rx();
                          set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                          nrf_esb_start_rx();
                    }

                }
                sort_neighbors_by_rssi(Nxt_neighbor_table, Nxt_table_index - 1);
                Diagnostic_Test = 0;
          }
          else if(Current_Circle == MAX_CIRCLE)
          {

                for(neighbour_no = MIN_NODES; neighbour_no < MAX_NODES ;)
                {
                      if(Ack_Txing == 0)
                      {
                            nrf_esb_stop_rx();
                            set_slave_adress( neighbour_no ,arrays[Current_Circle - 1]);
                            memset(&header,0,sizeof(header));
                            header.packet_type = 1;
                            header.length = 1;
                            header.circle_array[Current_Circle] = addr_prefix[0];
                            memcpy(tx_payload.data,&header,sizeof(header));
                            memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                            tx_payload.length = (sizeof(header) + sizeof("HAI"));
                            done_rx_start = 1;
                            if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                            {
                                  nrf_delay_us(50000); //to send the data 
                                  //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                                  //   nrf_esb_start_rx();
                            }
                      }
                      if(done_rx_start == 1 && Ack_Txing == 1)
                      {
                      done_rx_start = 0;
                         nrf_esb_flush_tx();
                        nrf_esb_flush_rx();
                      set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                      nrf_esb_start_rx();
                      }

                }
                sort_neighbors_by_rssi(Prev_neighbor_table, Prev_table_index - 1);
                Diagnostic_Test = 0;
          }
          else 
          {

                  for( neighbour_no = MIN_NODES; neighbour_no < MAX_NODES ;)
                  {
                        if(Ack_Txing == 0)
                        {
                                nrf_esb_stop_rx();
                                set_slave_adress( neighbour_no ,arrays[Current_Circle - 1]);
                                memset(&header,0,sizeof(header));
                                header.packet_type = 1;
                                header.length = 1;
                                header.circle_array[Current_Circle] = addr_prefix[0];
                                memcpy(tx_payload.data,&header,sizeof(header));
                                memcpy(tx_payload.data + sizeof(header),"HAI",sizeof("HAI"));
                                tx_payload.length = (sizeof(header) + sizeof("HAI"));
                                done_rx_start = 1;
                                if (nrf_esb_write_payload(&tx_payload) == NRF_SUCCESS)
                                {
                                      nrf_delay_us(50000); //to send the data 
                                      //  set_slave_adress(addr_prefix[0],arrays[Current_Circle]);
                                      //  nrf_esb_start_rx();
                                }

                                if(done_rx_start == 1 && Ack_Txing == 1)
                                {
                                      done_rx_start = 0;
                                         nrf_esb_flush_tx();
                                        nrf_esb_flush_rx();
                                      set_slave_adress(addr_prefix[0], arrays[Current_Circle]); 
                                      nrf_esb_start_rx();
                                }
                        }

